app/controllers/customers_controller.rb

  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save
---
INSERT INTO `customers` (`birth_date`, `cust_num`, `first_name`, `last_name`, `gender`, `phone_num`, `store_id`, `created_at`, `updated_at`) VALUES ('2017-11-06', 111, 'Bob', 'Black', 'M', '630-804-5555', 1, '2017-11-06 17:15:09', '2017-11-06 17:15:09')

    def set_customer
      @customer = Customer.find(params[:id])
---
SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1