app/controllers/employees_controller.rb

  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save
---
INSERT INTO `employees` (`emp_no`, `birth_date`, `first_name`, `last_name`, `gender`, `hire_date`, `titles`, `created_at`, `updated_at`) VALUES (1, '1994-04-01', 'Kyle', 'Grondin', 'Male', '1994-04-01', 'CEO', '2017-10-24 19:29:46', '2017-10-24 19:29:46')

  def update
    respond_to do |format|
      if @employee.update(employee_params)
---
UPDATE `employees` SET `birth_date` = '2017-10-26', `hire_date` = '2017-10-26', `updated_at` = '2017-10-26 15:59:21' WHERE `employees`.`id` = 1

    def set_employee
      @employee = Employee.find(params[:id])
---
SELECT  `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1