app/controllers/foods_controller.rb

SELECT `foods`.* FROM `foods`
---
  def index
    @foods = Food.all

INSERT INTO `foods` (`name`, `expiration`, `data`, `price`, `foodType`, `quantity`, `created_at`, `updated_at`) VALUES ('Treats', '', '2017-10-24', 10.0, 'cookies', 75, '2017-10-24 18:28:48', '2017-10-24 18:28:48')
---
  def create
    @food = Food.new(food_params)

    respond_to do |format|
      if @food.save

UPDATE `foods` SET `quantity` = 15, `store_id` = 1, `expirationDate` = '2017-11-30', `updated_at` = '2017-11-30 19:49:18' WHERE `foods`.`id` = 1
---
  def update
    respond_to do |format|
      if @food.update(food_params)

SELECT  `foods`.* FROM `foods` WHERE `foods`.`id` = 1 LIMIT 1
---
    def set_food
      @food = Food.find(params[:id])