app/controllers/pets_controller.rb

  def index
    @pets = Pet.all
---
SELECT `pets`.* FROM `pets`

  def create
    @pet = Pet.new(pet_params)

    respond_to do |format|
      if @pet.save
---
INSERT INTO `pets` (`name`, `description`, `price`, `dob`, `typeOfAnimal`, `created_at`, `updated_at`, `store_id`, `avatar_file_name`, `avatar_content_type`, `avatar_file_size`, `avatar_updated_at`) VALUES ('Andrei', 'fugly slut', 0, '2017-11-14', 'skunk', '2017-11-14 20:29:51', '2017-11-14 20:29:51', 1, 'impossibly-cute-puppy-21.jpg', 'image/jpeg', 33543, '2017-11-14 20:29:50')

  def update
    respond_to do |format|
      if @pet.update(pet_params)
---
UPDATE `pets` SET `store_id` = 1, `avatar_file_name` = 'impossibly-cute-puppy-21.jpg', `avatar_content_type` = 'image/jpeg', `avatar_file_size` = 33543, `avatar_updated_at` = '2017-11-14 20:22:22', `updated_at` = '2017-11-14 20:22:22' WHERE `pets`.`id` = 1

  def destroy
    @pet.destroy
---
DELETE FROM `pets` WHERE `pets`.`id` = 4

    def set_pet
      @pet = Pet.find(params[:id])
---
SELECT  `pets`.* FROM `pets` WHERE `pets`.`id` = 4 LIMIT 1