app/controllers/stores_controller.rb

SELECT `stores`.* FROM `stores`
---
  def index
    @stores = Store.all

INSERT INTO `stores` (`created_at`, `updated_at`, `street_line_1`, `street_line_2`, `city`, `state`, `zip_code`) VALUES ('2017-11-06 17:14:01', '2017-11-06 17:14:01', '123 green street', '', 'Aurora', 'Colorado', 60534)
---
  def create
    @store = Store.new(store_params)

    respond_to do |format|
      if @store.save

UPDATE `stores` SET `street_line_1` = '123 Jefferson Street', `street_line_2` = '', `city` = 'Oswego', `state` = 'IL', `zip_code` = 60543, `updated_at` = '2017-10-26 19:27:48' WHERE `stores`.`id` = 1
---
  def update
    respond_to do |format|
      if @store.update(store_params)

DELETE FROM `stores` WHERE `stores`.`id` = 1
---
  def destroy
    @store.destroy

SELECT  `stores`.* FROM `stores` WHERE `stores`.`id` = 1 LIMIT 1
---
    def set_store
      @store = Store.find(params[:id])