app/controllers/toys_controller.rb

  def index
    @toys = Toy.all
---
SELECT `toys`.* FROM `toys`

  def create
    @toy = Toy.new(toy_params)

    respond_to do |format|
      if @toy.save
---
INSERT INTO `toys` (`brand`, `quantity`, `description`, `created_at`, `updated_at`, `store_id`, `toyType`) VALUES ('Kong', 150, '', '2017-10-26 19:57:17', '2017-10-26 19:57:17', 1, 'Chew Toy')

  def update
    respond_to do |format|
      if @toy.update(toy_params)
---
UPDATE `toys` SET `brand` = 'Kong', `type` = 'Chew Toy', `quantity` = 1, `description` = 'Chew toy for dog', `store_id` = 1, `updated_at` = '2017-10-26 15:34:09' WHERE `toys`.`id` = 1

    def set_toy
      @toy = Toy.find(params[:id])
---
SELECT  `toys`.* FROM `toys` WHERE `toys`.`id` = 1 LIMIT 1